{
    "Potato___Early_blight": "Prune or stake plants to improve air circulation and reduce fungal problems. Make sure to disinfect your pruning shears (one part bleach to 4 parts water) after each cut.Keep the soil under plants clean and free of garden debris. Add a layer of organic compost to prevent the spores from splashing back up onto vegetation. Drip irrigation and soaker hoses can be used to help keep the foliage dry. For best control, apply copper-based fungicides early, two weeks before disease normally appears or when weather forecasts predict a long period of wet weather. Alternatively, begin treatment when disease first appears, and repeat every 7-10 days for as long as needed.",
    "Potato___Late_blight": "Plant resistant cultivars when available. Remove volunteers from the garden prior to planting and space plants far enough apart to allow for plenty of air circulation. Water in the early morning hours, or use soaker hoses, to give plants time to dry out during the day — avoid overhead irrigation. Destroy all tomato and potato debris after harvest",
    "Tomato___Early_blight": "Use pathogen-free seed, or collect seed only from disease-free plants. Rotate out of tomatoes and related crops for at least two years. Control susceptible weeds such as black nightshade and hairy nightshade, and volunteer tomato plants throughout the rotation. Fertilize properly to maintain vigorous plant growth. Particularly, do not over-fertilize with potassium and maintain adequate levels of both nitrogen and phosphorus. Avoid working in plants when they are wet from rain, irrigation, or dew. Use drip irrigation instead of overhead irrigation to keep foliage dry. Stake the plants to increase airflow around the plant and facilitate drying. Staking will also reduce contact between the leaves and spore-contaminated soil.",
    "Tomato___Tomato_Yellow_Leaf_Curl_Virus":  "The most effective treatments used to control the spread of TYLCV are insecticides and resistant crop varieties. Symptomatic plants should be carefully covered by a clear or black plastic bag and tied at the stem at soil line. If symptomatic plants have no obvious whiteflies on the lower leaf surface, these plants can be cut from the garden and BURIED in the compost. ",
    "Tomato___Bacterial_spot": "Using pathogen-free seed and disease-free transplants, when possible, is the best way to avoid bacterial spot on tomato. Avoiding sprinkler irrigation and cull piles near greenhouse or field operations, and rotating with a nonhost crop also helps control the disease.",
    "Tomato___Leaf_Mold": "Upon noticing the infected areas, the first step is to let the plants air out and dry. If they are being cultivated in a greenhouse, expose them to dry air conditions, because the humidity that the fungus needs to survive and thrive is dried up in the open air. If the tomatoes are being cultivated outdoors, try to keep the leaves dry when watering the plants. One thing you can do to help keep the leaves as dry as possible is to water in the early morning hours, that way the plant has plenty of time to dry before the sun comes out, which will keep the humidity around the leaves low. You can also try drip irrigation methods, or soak watering methods to attempt to water the soil without ever wetting the leaves of the plant.",
    "Tomato___Target_Spot" : "Remove old plant debris at the end of the growing season; otherwise, the spores will travel from debris to newly planted tomatoes in the following growing season, thus beginning the disease anew. Dispose of the debris properly and don’t place it on your compost pile unless you’re sure your compost gets hot enough to kill the spores. Rotate crops and don’t plant tomatoes in areas where other disease-prone plants have been located in the past year– primarily eggplant, peppers, potatoes or, of course– tomatoes. Rutgers University Extension recommends a three year rotation cycle to reduce soil-borne fungi. Pay careful attention to air circulation, as target spot of tomato thrives in humid conditions. Grow the plants in full sunlight. Be sure the plants aren’t crowded and that each tomato has plenty of air circulation. Cage or stake tomato plants to keep the plants above the soil." ,
    "Tomato___Spider_mites Two-spotted_spider_mite" : "The best way to begin treating for two-spotted mites is to apply a pesticide specific to mites called a miticide. Ideally, you should start treating for two-spotted mites before your plants are seriously damaged. Apply the miticide for control of two-spotted mites every 7 days or so. Since mites can develop resistance to chemicals, switch to another type of miticide after three applications.",
    "Tomato___Tomato_mosaic_virus" : "The use of ToMV-resistant varieties is generally the best way to reduce losses from this disease. Avoid planting in soil from previous crops that were infected with ToMV. Steam sterilizing the potting soil and containers as well as all equipment after each crop can reduce disease incidence. Before handling containers or plants be sure all workers wash with soap and water. Sterilizing pruning utensils or snapping off suckers without touching the plant instead of knife pruning help reduce disease incidence. Direct seeding in the field can help reduce the spread of ToMV.",
    "Tomato___Septoria_leaf_spot" : "Remove infected leaves immediately, and be sure to wash your hands and pruners thoroughly before working with uninfected plants. Fungicides containing either copper or potassium bicarbonate will help prevent the spreading of the disease. Begin spraying as soon as the first symptoms appear and follow the label directions for continued management. While chemical options are not ideal, they may be the only option for controlling advanced infections. One of the least toxic and most effective is chlorothalonil (sold under the names Fungonil and Daconil).",
    "Tomato___Late_blight" : "Plant resistant cultivars when available. Remove volunteers from the garden prior to planting and space plants far enough apart to allow for plenty of air circulation. Water in the early morning hours, or use soaker hoses, to give plants time to dry out during the day — avoid overhead irrigation. Destroy all tomato and potato debris after harvest. Apply a copper based fungicide (2 oz/ gallon of water) every 7 days or less, following heavy rain or when the amount of disease is increasing rapidly. If possible, time applications so that at least 12 hours of dry weather follows application.",
    "Cherry___Powdery_mildew" : "Plant resistant cultivars in sunny locations whenever possible. Prune or stake plants to improve air circulation. Make sure to disinfect your pruning tools (one part bleach to 4 parts water) after each cut. Remove diseased foliage from the plant and clean up fallen debris on the ground. Use a thick layer of mulch or organic compost to cover the soil after you have raked and cleaned it well. Mulch will prevent the disease spores from splashing back up onto the leaves. Milk sprays, made with 40% milk and 60% water, are an effective home remedy for use on a wide range of plants. For best results, spray plant leaves as a preventative measure every 10-14 days. Wash foliage occasionally to disrupt the daily spore-releasing cycle. Neem oil and PM Wash, used on a 7 day schedule, will prevent fungal attack on plants grown indoors.",
    "Pepper___Bacterial_spot": "Seed treatment with sodium hypochlorite (for example, Clorox) is effective in reducing bacterial populations on seed surfaces. Control of bacterial spot on greenhouse transplants is an essential step for preventing spread of the leaf spot bacteria in the field. Transplants should be inspected regularly to identify symptomatic seedlings. Transplants with symptoms may be removed and destroyed or treated with streptomycin. Products containing microorganisms can be used to enhance plant growth and reduce the negative effects of diseases. These products may contain plant-growth-promoting rhizobacteria (PGPR) or biological agents",
    "Apple___Apple_scab" : "This disease is caused by a fungus that infects the leaves, fruit, and twigs of apple trees. To prevent apple scab, it is important to plant disease-resistant varieties of apple trees and to remove and destroy infected leaves, fruit, and twigs. Fungicides can also be applied to the trees to help prevent the disease.",
    "Apple___Black_rot" : "During the winter, check for red cankers and remove them by cutting them out or pruning away the affected limbs at least 6 inches (15 cm.) beyond the wound. Additionally using fungicides like copper-based sprays and lime sulfur, can be used to control black rot, nothing will improve apple black rot like removing all sources of spores.",
    "Apple___Cedar_apple_rust" : "Remove galls from infected junipers. Rake up and dispose of fallen leaves and other debris from under trees. In some cases, juniper plants should be removed entirely. On juniper, rust can be controlled by spraying plants with a copper solution (0.5 to 2.0 oz/ gallon of water) at least four times between late August and late October.",
    "Cherry___Powdery_mildew" : "To help prevent or treat powdery mildew, you can plant disease-resistant varieties of cherry, remove and destroy infected leaves and plant debris, and apply fungicides as needed. Additionally, practicing good cultural practices, such as proper watering and fertilizing, and implementing proper sanitation measures, such as removing and destroying infected plant debris, can also help prevent powdery mildew. It may also be helpful to space plants properly to allow for good air circulation and avoid overhead irrigation, as these conditions can help prevent the development and spread of powdery mildew.",
    "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot" : "Planting hybrids with a high level of genetic resistance can help reduce the risk of yield loss due to gray leaf spot infection. Fungicides containing pyraclostrobin and strobilurin, or combinations of azoxystrobin and propiconazol, prothioconazole and trifloxystrobin work well to control the fungus",
    "Corn_(maize)___Common_rust_" : " Use Plant hybrids like Deccan, Ganga-5, Deccan Hybrid Makka-103 and DHM - 1 which are resistant to this disease to minimise the disease intensity. Additionally, Spray Mancozeb 2.5g/lit or Dithane M-45 spray can be taken (0.4%) as soon as first symptoms are observed and it can be repeated at 10 days interval till flowering.",
    "Corn_(maize)___Northern_Leaf_Blight" : "choose corn varieties or hybrids that are resistant or at least have moderate resistance to northern corn leaf blight.make sure it does not stay wet for long periods of time. The fungus that causes this infection needs between six and 18 hours of leaf wetness to develop. Use common corn foliar fungicides like picoxystrobin, tetraconazole, pyraclostobin or propiconazole.",
    "Grape___Black_rot" : "Destroy mummies remove diseased tendrils from the wires, and select fruiting canes without lesions. It is very important not to leave mummies attached to the vine. Using Protectant Fungicides like Mancozeb, and Ziram are all highly effective against black rot in protect fruit and foliage by preventing spore germination.",
    "Grape___Esca_(Black_Measles)" : "Delaying pruning to as late as possible in the dormant season has been shown to be very effective in reducing the risk of infection. Delayed pruning takes advantage of reduced susceptibility of pruning wounds to infection and avoids the period of highest spore release during typically frequent rain events. Additionally, you can use pesticides like Thiophanate-Methyl, Myclobutanil 4-5 oz, or tetraconazole.Apply with enough water to provide complete coverage.",
    "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)" : "Apply dormant sprays to reduce inoculum levels. Protectants such as mancozeb and ziram can provide economical early-season control. Spraying of the grapevines at 3-4 leaf stage with fungicides like Bordeaux mixture of 0.8% or Copper Oxychloride of 0.25% or Carbendazim of 0.1% are effective against this disease.",
    "Strawberry___Leaf_scorch" : "To help prevent or treat leaf scorch, you can plant disease-resistant varieties of strawberry, remove and destroy infected leaves and plant debris, and apply fungicides as needed. Additionally, practicing good cultural practices, such as proper watering and fertilizing, and implementing proper sanitation measures, such as removing and destroying infected plant debris, can also help prevent leaf scorch. It may also be helpful to avoid overwatering and to water plants at the base rather than from overhead to help prevent the development and spread of leaf scorch.",
    "Peach___Bacterial_spot" : "To help prevent or treat bacterial spot, you can plant disease-resistant varieties of peach, remove and destroy infected leaves and plant debris, and apply bactericides as needed. Additionally, practicing good cultural practices, such as proper watering and fertilizing, and implementing proper sanitation measures, such as removing and destroying infected plant debris, can also help prevent bacterial spot. It may also be helpful to avoid overhead irrigation and to avoid wounding the plants, as these conditions can help prevent the development and spread of bacterial spot."
}